{
  //
  // workbook-01.js
  // 問題番号：01 ~ 08
  // 各設問に対するプログラムを{}の中に実装しましょう。
  //

  {
    // ----------------------------------------
    // 01. 「Hello World!」を表示する
    // ----------------------------------------
    console.log("<<< 01.「 Hello World! 」を表示する >>>");
    console.log("Hello World!");



  }

  {
    // ----------------------------------------
    // 02. 「EC」と「C」を連結して「ECC」を表示する
    // ----------------------------------------
    console.log("<<< 02. 「 EC 」と「 C 」を連結して「ECC」を表示する >>>");



  }

  {
    // ----------------------------------------
    // 03. ２つの数値を入力して、その合計を表示する
    // ----------------------------------------
    console.log("<<< 03.２つの数値を入力して、その合計を表示する >>>");




  }

  {
    // ----------------------------------------
    // 04. ２つの数値を入力して、その余りを表示する
    // ----------------------------------------
    console.log("<<< 04. ２つの数値を入力して、その余りを表示する >>>");



  }

  {
    // ----------------------------------------
    // 05. 2つの整数値を入力して、その和・差・積・商と余りを表示する
    // ----------------------------------------
    console.log("<<< 05. 2つの整数値を入力して、その和・差・積・商・余を表示する >>>");




  }

  {
    // ----------------------------------------
    // 06. 消費税の計算
    // ----------------------------------------
    console.log("<<< 金額と消費税率を入力して、消費税の金額をコンソールに表示する >>>");



  }

  {
    // ----------------------------------------
    // 07. 円の面積
    // ----------------------------------------
    console.log("<<< 半径を入力して、円の面積をコンソールに表示する >>>");



  }

  {
    //
    // 08. 小数点の桁数指定
    //
    console.log("<<< ２つの整数を入力して、その除算結果と小数点以下第２位までに丸めた結果をコンソールに表示する >>>");



  }

}